In [1]:
import pandas as pd
import numpy as np

In [2]:
#contoh1 - imputasi mean
#masukkan data

kolom = {'col1' : [2,9,19],
        'col2' : [2,np.nan,17],
        'col3' : [3,9, np.nan],
        'col4' : [ 6,0,9],
        'col5' : [ np.nan,7,np.nan ]}

In [3]:
umur = {'umur' : [29, 43, np.nan,25,34,np.nan,50]}

#ubah ke dataframe
data = pd.DataFrame(umur)
#tampilkan nilai pada variabel

data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [4]:
#untuk mengisi data yang kosong
data.fillna(data.mean())

#data.fillna(isidata yang diinginkan) --> fungsi untuk menganti missing

   umur
0  29.0
1  43.0
2  36.2
3  25.0
4  34.0
5  36.2
6  50.0

In [5]:
data.fillna(99)
# ini bisa kasih nilai suka suka terserah kita. disini kita pakai 99 =, jadi nilai yang kosong menjadi 99

   umur
0  29.0
1  43.0
2  99.0
3  25.0
4  34.0
5  99.0
6  50.0

In [6]:
#Contoh 1 - Imputasi END OF TAIL
#Import EndTailImputer

from feature_engine.imputation import EndTailImputer

#Membuat imputer
imputer = EndTailImputer(imputation_method='gaussian', tail='right')

#Fit imputer ke set 
imputer.fit(data)

#Mengubah data
test_t = imputer.transform(data)

In [7]:
test_t

        umur
0  29.000000
1  43.000000
2  66.896905
3  25.000000
4  34.000000
5  66.896905
6  50.000000

In [9]:
from sklearn.impute import SimpleImputer

In [10]:
make ={'make' :['Ford','Ford','Fiat', "BMW",'Ford','Kia',np.nan, 'Kia']}

#ubah menjadi dataframe
data = pd.DataFrame(make)

#tampilkan
data

   make
0  Ford
1  Ford
2  Fiat
3   BMW
4  Ford
5   Kia
6   NaN
7   Kia

In [11]:
imp = SimpleImputer(strategy='most_frequent')

In [13]:
imp.fit_transform(data)

array([['Ford'],
       ['Ford'],
       ['Fiat'],
       ['BMW'],
       ['Ford'],
       ['Kia'],
       ['Ford'],
       ['Kia']], dtype=object)